app/controllers/api/main_courses_controller.rb

SELECT  "main_courses".* FROM "main_courses" WHERE (id = '10')  ORDER BY "main_courses"."id" ASC LIMIT 1
SELECT "main_courses".* FROM "main_courses"
---
            def find_by_id
                @mainCourse = MainCourse.where("id = ?", params[:id]).first

                if @mainCourse.blank?