app/controllers/api/meals_controller.rb

            def index
                @meals = Meal.where(nil)

                filterValue = ""
                filterType = ""

                if params[:userId].present?
                    filterValue = params[:userId]
                    filterType = "userId"
                    @meals = @meals.with_user_id(filterValue)
                end

                if @meals.blank?
---
SELECT "meals".* FROM "meals" WHERE (userId = '2')
SELECT "meals".* FROM "meals" WHERE ("userId" = '2')

            def find_by_id
                @meal = Meal.where("id = ?", params[:id]).first
---
SELECT  "meals".* FROM "meals" WHERE (id = '1')  ORDER BY "meals"."id" ASC LIMIT 1