app/controllers/api/sides_controller.rb

SELECT  "sides".* FROM "sides" WHERE (id = '2')  ORDER BY "sides"."id" ASC LIMIT 1
SELECT "sides".* FROM "sides"
---
            def find_by_id
                @side = Side.where("id = ?", params[:id]).first

                if @side.blank?